tap "homebrew/bundle"
tap "leoafarias/fvm"
tap "oven-sh/bun"
brew "jpeg-xl"
brew "aom"
brew "pycparser"
brew "cffi"
brew "python@3.12"
brew "awscli"
brew "bzip2"
brew "cairo"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cocoapods"
brew "deno"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "fastlane"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "fzy"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jenv"
brew "node"
brew "node-build"
brew "nodenv"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "pngquant"
brew "pnpm"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "rbenv"
brew "rustup"
brew "tig"
brew "vim"
brew "yarn"
brew "zlib"
brew "zplug"
brew "leoafarias/fvm/fvm"
brew "oven-sh/bun/bun"
cask "1password"
cask "alfred"
cask "clipy"
cask "corretto@21"
cask "cyberduck"
cask "discord"
cask "dropbox"
cask "fig"
cask "firefox"
cask "github"
cask "google-drive"
cask "google-japanese-ime"
cask "graalvm-jdk@21"
cask "iterm2"
cask "macwinzipper"
cask "microsoft-openjdk@21"
cask "notion"
cask "obsidian"
cask "raycast"
cask "sapmachine-jdk"
cask "semeru-jdk-open@21"
cask "spectacle"
cask "temurin@21"
cask "visual-studio-code"
cask "warp"
cask "zulu@21"
vscode "1natsu.insert-br-tag"
vscode "alexisvt.flutter-snippets"
vscode "appcypher.astro"
vscode "arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "circlecodesolution.ccs-flutter-color"
vscode "clinyong.vscode-css-modules"
vscode "cpylua.language-postcss"
vscode "cs50.vscode-presentation-mode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "davidwoo.flutter-auto-import"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "diemasmichiels.emulate"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.next-js"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "hwencc.html-tag-wrapper"
vscode "ijs.emotionsnippets"
vscode "ionutvmi.path-autocomplete"
vscode "jonkwheeler.styled-components-snippets"
vscode "joy-yu.css-snippets"
vscode "kingwl.vscode-vitest-runner"
vscode "lys.vscode-vitest-run-it"
vscode "marcelovelasquez.flutter-tree"
vscode "marp-team.marp-vscode"
vscode "me-dutour-mathieu.vscode-firebase"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "nash.awesome-flutter-snippets"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "paulmolluzzo.convert-css-in-js"
vscode "phoenisx.cssvar"
vscode "pivaszbs.svelte-autoimport"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.vscode-yaml"
vscode "ricard.postcss"
vscode "rvest.vs-code-prettier-eslint"
vscode "s-nlf-fh.glassit"
vscode "shardulm94.trailing-spaces"
vscode "sheltonlouis.astro-snippets"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "stordahl.sveltekit-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "thomas-baumgaertner.vcl"
vscode "toba.vsfire"
vscode "twxs.cmake"
vscode "typespec.typespec-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "visualstudioexptteam.vscodeintellicode-insiders"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vunguyentuan.vscode-css-variables"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
